In [1]:
##1. Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each
##of the data types into a pandas series. Create a separate list of index values for the
##series.

In [2]:
import pandas as pd

In [3]:
lista= list(range(1,11))
print(lista)
list1=pd.Series(lista)
print(list1)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [4]:
tuple1 = tuple(lista)
print(tuple1)
tup_S = pd.Series(tuple1)
print(tup_S)

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [5]:
! pip install ordered-set

Requirement already satisfied: ordered-set in c:\users\hp\anaconda3\lib\site-packages (4.1.0)

In [6]:
from ordered_set import OrderedSet

In [7]:
set1= OrderedSet(range(1,11))
print("the set is:", set1)
# create series from the set
set_S = pd.Series(set1)
print(set_S)

the set is: OrderedSet([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [8]:
index = ['a','b','c','d','e','f','g','h','i','j']
pd.Series(lista,index= index)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [9]:
##2. Create a python dictionary with three key value pairs. Keep the keys as the first names,
##and the respective last names as values in the dictionary. Use the dictionary to create a
##pandas series.

In [10]:
dict1= {'ajay':'kumar',"swaraj":'sharma',"disha":'gautam' }
dict1

{'ajay': 'kumar', 'swaraj': 'sharma', 'disha': 'gautam'}

In [11]:
pd.Series(dict1)

ajay       kumar
swaraj    sharma
disha     gautam
dtype: object

In [12]:
##3. Create a pandas series, with the elements as numbers from 1-10. Use the index values
##starting from 0-10. For the above series:
##a. Convert it to a list.
##b. Convert it to a dictionary.
#c. Convert it to a tuple.
#d. Convert it to a set.

In [13]:
series = pd.Series(range(1,11))
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [14]:
#a
list(series)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [15]:
tuple(series)

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [16]:
set(series)

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [17]:
dict(series)

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [18]:
##4. Create a sample pandas series with x integer elements. Perform the following operations
##on the same:
#a. Print the first 5 elements of the series
#b. Print the last 5 elements of the series
#c. Insert an integer value ‘50’ at the index 5.
#d. Update the last element in the series with the value 100.
#e. Delete the first element from the series.

In [19]:
series2= series
series2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [20]:
#a
series2[:5]

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [21]:
#b  Print the last 5 elements of the series

In [22]:
series2[-5:]

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [23]:
#c. Insert an integer value ‘50’ at the index 5.

In [24]:
series2[5]=50
series2

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [25]:
#d. Update the last element in the series with the value 100.

In [26]:
series2[10]=100
series2.iloc[10]=100

In [27]:
series2

0       1
1       2
2       3
3       4
4       5
5      50
6       7
7       8
8       9
9      10
10    100
dtype: int64

In [28]:
##e. Delete the first element from the series.

In [29]:
series2= series2.drop(0)
series2

1       2
2       3
3       4
4       5
5      50
6       7
7       8
8       9
9      10
10    100
dtype: int64

In [30]:
series2.reset_index(drop = True)

0      2
1      3
2      4
3      5
4     50
5      7
6      8
7      9
8     10
9    100
dtype: int64

In [31]:
##5. For a given pandas series obtained in the 4th step. Write a sample code to find the
##element 100 in the series.

In [32]:
for i in series2:
    if i == 100:
        print("Element",i)

Element 100

In [33]:
for i in range(1,len(series2)+1):
    if series2[i]==100:
        print(i,series2[i])

10 100

In [34]:
#6. For the given series A and B, perform concatenation on the same.
#series_A = pd.Series([1,2,3,4,5])
#series_B = pd.Series([6,7,8,9,10])

In [35]:
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])
pd.concat([series_A,series_B])

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [36]:
pd.concat([series_A,series_B], ignore_index = True)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [37]:
##7. Using loops in python, print all the elements within a pandas series.
#Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [38]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

Sample

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [39]:
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

In [40]:
##8. For a given nested list and a sample dictionary, create two data frames using pandas.
##List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
#3Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [41]:
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
dataframe = pd.DataFrame(List,index=['a','b','c'])
dataframe

    0   1   2
a  AA  BB  CC
b  DD  EE  FF
c  GG  HH  II

In [42]:
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}
dataframe2= pd.DataFrame(Dictionary)
dataframe2

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

In [43]:
##9. Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following
#operations on the same.
#a. Print the first 3 rows of the Data Frame .
#b. Print the rows that have the age greater than 15.
#c. Insert 5 imaginary names and ages as values to the pandas Data Frame .
#d. Update the 5th row so that the name = john and age=56.
#e. Delete the first row from the Data Frame .

In [44]:
data= [['akash',25],['nick',23],['joy',26],['ishita',24]]
df3=pd.DataFrame(data,columns= ['name','age'])
df3

     name  age
0   akash   25
1    nick   23
2     joy   26
3  ishita   24

In [45]:
df3.shape

(4, 2)

In [46]:
#a. Print the first 3 rows of the Data Frame .

In [47]:
df3[0:3]

    name  age
0  akash   25
1   nick   23
2    joy   26

In [48]:
#b. Print the rows that have the age greater than 15.

In [49]:
df3[df3.age > 15]

     name  age
0   akash   25
1    nick   23
2     joy   26
3  ishita   24

In [50]:
#c. Insert 5 imaginary names and ages as values to the pandas Data Frame .

In [51]:
df3.loc[4]=['priya',21]

In [52]:
df3

     name  age
0   akash   25
1    nick   23
2     joy   26
3  ishita   24
4   priya   21

In [53]:
## task add more name and value

In [54]:
##d. Update the 5th row so that the name = john and age=56.

In [56]:
df3.loc[4,'name']='john'
df3.loc[4,'age']=56

In [57]:
df3

     name  age
0   akash   25
1    nick   23
2     joy   26
3  ishita   24
4    john   56

In [58]:
#e. Delete the first row from the Data Frame .

In [59]:
df3.drop(0)

     name  age
1    nick   23
2     joy   26
3  ishita   24
4    john   56

In [60]:
#10. For the Data Frame obtained from step 9, convert the same to a list and a dictionary
#respectively.

In [63]:
l3 = list(df3.values)
l3

[array(['akash', 25], dtype=object),
 array(['nick', 23], dtype=object),
 array(['joy', 26], dtype=object),
 array(['ishita', 24], dtype=object),
 array(['john', 56], dtype=object)]

In [64]:
d3=dict(df3.values)
d3

{'akash': 25, 'nick': 23, 'joy': 26, 'ishita': 24, 'john': 56}

In [65]:
##11. Create two separate Data Frame s A and B, and perform the following operations on
##them.
#a. Concatenate the two Data Frame s to a new Data Frame C.

In [68]:
## create data frame.
A= pd.DataFrame(list(range(1,20+1)),columns=["A"])
print("Data frame A: \n" , A)
B=pd.DataFrame(list(range(20,0,-1)),columns=["B"])
print("\nData frame B: \n", B)

Data frame A:
      A
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9   10
10  11
11  12
12  13
13  14
14  15
15  16
16  17
17  18
18  19
19  20

Data frame B:
      B
0   20
1   19
2   18
3   17
4   16
5   15
6   14
7   13
8   12
9   11
10  10
11   9
12   8
13   7
14   6
15   5
16   4
17   3
18   2
19   1

In [69]:
#a. Concatenate the two Data Frame s to a new Data Frame C.

In [71]:
C = pd.concat([A,B], axis=1)
C

     A   B
0    1  20
1    2  19
2    3  18
3    4  17
4    5  16
5    6  15
6    7  14
7    8  13
8    9  12
9   10  11
10  11  10
11  12   9
12  13   8
13  14   7
14  15   6
15  16   5
16  17   4
17  18   3
18  19   2
19  20   1

In [72]:
##b. Split the Data Frame C row wise.

In [77]:
split_C= C.iloc[0:5,:]
print(split_C)

   A   B
0  1  20
1  2  19
2  3  18
3  4  17
4  5  16

In [78]:
split_C= C.iloc[6:,:]
print(split_C)

     A   B
6    7  14
7    8  13
8    9  12
9   10  11
10  11  10
11  12   9
12  13   8
13  14   7
14  15   6
15  16   5
16  17   4
17  18   3
18  19   2
19  20   1

In [79]:
##c. Split the Data Frame column wise based on a condition. For example - columns
##values greater than 10, column values less than 10, etc.

In [80]:
greater_10 = C["B"]>=10
c_10= C[greater_10]
print("values grter thn 10: \n", c_10)

values grter thn 10:
      A   B
0    1  20
1    2  19
2    3  18
3    4  17
4    5  16
5    6  15
6    7  14
7    8  13
8    9  12
9   10  11
10  11  10

In [81]:
### task write less thn

In [82]:
##12. Create a Data Frame with columns Name and Age. Perform the following operations.
##a. Write a sample code to search for the Name/Names where Age is 20.
##b. Sort the Data Frame in ascending order of ages.
##c. Using Python loops, print the ages from the data frame and store it in a set

In [83]:
df4 = pd.DataFrame.from_dict({'name':['jenny','matt','kristan','jenny','matt','kristan','jenny','matt','kristan'],
                             'age':[20,21,32,20,21,17,23,24,35],
                             'gender':['F','M','F','F','F','M','F','F','F']})

In [84]:
df4

      name  age gender
0    jenny   20      F
1     matt   21      M
2  kristan   32      F
3    jenny   20      F
4     matt   21      F
5  kristan   17      M
6    jenny   23      F
7     matt   24      F
8  kristan   35      F

In [85]:
##a. Write a sample code to search for the Name/Names where Age is 20.

In [86]:
df4[df4.age==20]

    name  age gender
0  jenny   20      F
3  jenny   20      F

In [87]:
###b. Sort the Data Frame in ascending order of ages.

In [88]:
df4.sort_values(by='age')

      name  age gender
5  kristan   17      M
0    jenny   20      F
3    jenny   20      F
1     matt   21      M
4     matt   21      F
6    jenny   23      F
7     matt   24      F
2  kristan   32      F
8  kristan   35      F

In [89]:
##c. Using Python loops, print the ages from the data frame and store it in a set

In [90]:
l = []
for i in range(len(df4)):
    l.append(df4.loc[i,'age'])
print(l)
set1=set(l)
print(set1)

[20, 21, 32, 20, 21, 17, 23, 24, 35]
{32, 35, 17, 20, 21, 23, 24}